// Задание 10: Объявите функцию `print_message`, которая принимает строку 
// и ничего не возвращает.

#include <iostream>
using namespace std;

int main()
{
    void print_message("Hello, C++!");
    cout << "hello, c++";
}