// Задание 17: Объявите и вызовите функцию `print`, которая принимает строку
// выводит её на консоль.

#include <iostream>
using namespace std;

bool print(string a) {
    cout << a;
}

int main()
{
    return 0;
}

