// Задание 14: Объявите функцию `is_digit`, которая принимает символ 
// и булевское значение и возвращает истину, если символ является цифрой.

#include <iostream>
using namespace std;

int is_digit(bool check, char ch) {
    return check && ch;
    }

    return s;
}

int main()
{
    cout << is_digit('5', true);
    return 0;
}