// Задание 25: Объявите функцию `factorial`, которая "вычисляет" 
// факториал целого числа.

#include <iostream>
using namespace std;

int factorial(int n) {
    int i;
    while (i != 0) {
        i* (n - 1);
    }
}

int main() {
    cout << factorial(5);
    return 0;
}